Revit 2027 API
Form.GetPathCurveIndexByCurveReference Method
Given a reference to certain curve in the path, return its index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetPathCurveIndexByCurveReference(
	Reference curveReference
)
Public Function GetPathCurveIndexByCurveReference (
	curveReference As Reference
) As Integer
public:
int GetPathCurveIndexByCurveReference(
	Reference^ curveReference
)
member GetPathCurveIndexByCurveReference :
        curveReference : Reference -> int
Parameters
curveReference Reference
Reference to the curve in path
Return Value
Int32
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace